---
kind: type
id: T:Autodesk.Revit.DB.RevitLinkGraphicsSettings
source: html/2673e53a-632b-327d-2bb3-b07fce16b81e.htm
---
# Autodesk.Revit.DB.RevitLinkGraphicsSettings

Settings to override display of Revit link in a view.

## Syntax (C#)
```csharp
public class RevitLinkGraphicsSettings : IDisposable
```